Autodesk.Revit.DB.FailureResolutionType
Enumeration to classify FailureResolutions by nature of operation they perform on failing Elements.
Since:
2011

Autodesk.Revit.DB.FailureResolutionType.Others
Resolution type does not match any of the above.

Autodesk.Revit.DB.FailureResolutionType.SaveDocument
Save the current document to avoid losing more if something serious occurs.

Autodesk.Revit.DB.FailureResolutionType.SetValue
Defines a resolution of a failure by setting an appropriate value in place of invalid value.

Autodesk.Revit.DB.FailureResolutionType.UnlockConstraints
Defines a resolution of a failure by unconstraining Element(s).

Autodesk.Revit.DB.FailureResolutionType.QuitEditMode
Defines a resolution of a failure by quitting an Edit Mode instead of committing changes.
Changes made in edit mode will be rolled back.

Autodesk.Revit.DB.FailureResolutionType.ShowElements
The standard "Show" may fail in some context, special resolution could be added in this condition to show failing element(s).

Autodesk.Revit.DB.FailureResolutionType.DetachElements
Defines a resolution of a failure by removing invalid relationships between elements such as joined
walls and roofs, grouped elements, and associated curves.

Autodesk.Revit.DB.FailureResolutionType.FixElements
Defines a resolution of a failure by changing failing Element(s) - specific change may vary depending
in type of failure and type of Element(s).

Autodesk.Revit.DB.FailureResolutionType.MoveElements
Defines a resolution of a failure by moving Element(s) to an appropriate location.

Autodesk.Revit.DB.FailureResolutionType.SkipElements
Defines a resolution of a failure by skipping Element(s) for which operation has failed and proceeding
with the rest of Elements.

Autodesk.Revit.DB.FailureResolutionType.DeleteElements
Defines a resolution of a failure by deleting Element(s) that caused the failure.

Autodesk.Revit.DB.FailureResolutionType.CreateElements
Defines a resolution of a failure where Revit will add new Element(s) in place of missing one(s).

Autodesk.Revit.DB.FailureResolutionType.Default
Special (reserved) type. It cannot be used as a type when defining a resolution, but can be used as a key to query default
resolution from FailureMessage or FailureDefinition.

Autodesk.Revit.DB.FailureResolutionType.Invalid
Special (reserved) type. This should be non-initialized value of any variable of FailureResolutionType,
end user should not see this value, API programmer could use this in initialization and comparison.